Revit 2026 API

# MEPAnalyticalConnectionGetFlow Method

---

Gets the flow value of this analytical connection.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double GetFlow()
```
```vb
Public Function GetFlow As Double
```
```cpp
public:
double GetFlow()
```
```fsharp
member GetFlow : unit -> float
```

#### Return Value

Double The flow value.

If the network flow is asynchronously calculated, this method would wait until the calculation is completed. This ensures the returned flow value is always up to date.

#### Reference

MEPAnalyticalConnection Class

Autodesk.Revit.DB Namespace